{
    "name": "Young People Survey",
    "source": "https://www.kaggle.com/datasets/miroslavsabo/young-people-survey/data",
    "data_intro": "In 2013, students of the Statistics class at FSEV UK were asked to invite their friends to participate in this survey. The data file (responses.csv) consists of 1010 rows and 150 columns (139 integer and 11 categorical). For convenience, the original variable names were shortened in the data file. See the columns.csv file if you want to match the data with the original names. The data contain missing values. The survey was presented to participants in both electronic and written form. The original questionnaire was in Slovak language and was later translated into English. All participants were of Slovakian nationality, aged between 15-30.",
    "is_splited": false,
    "overall_size": 1160,
    "train_size": 0,
    "test_size": 0,
    "c_classes": 13,
    "n_classes": 139,
    "cat_feature_intro": {
        "original": "* The original questionnaire was in Slovak language and was later translated",
        "short": "* For convenience, the original variable names were shortened in the",
        "Smoking": "Indicates the frequency or habit of smoking, rated from 1 to 5, where 1 means 'Never' and 5 means 'Very often'.",
        "Alcohol": "Indicates the frequency or habit of consuming alcohol, rated from 1 to 5, where 1 means 'Never' and 5 means 'Very often'.",
        "Punctuality": "Indicates the degree of punctuality, rated from 1 to 5, where 1 means 'Always late' and 5 means 'Always on time'.",
        "Lying": "Indicates the tendency to lie, rated from 1 to 5, where 1 means 'Never lie' and 5 means 'Lie frequently'.",
        "Internet usage": "Indicates the frequency of internet usage, rated from 1 to 5, where 1 means 'Never' and 5 means 'Very often'.",
        "Gender": "* (in slovak) Sleziak, P. - Sabo, M.: Gender differences in the prevalence of specific phobias. Forum Statisticum Slovacum. 2014, Vol. 10, No. 6. [Differences (gender + whether people lived in village/town) in the prevalence of phobias.]",
        "Left - right handed": "Indicates whether the participant is left-handed or right-handed.",
        "Education": "Indicates the education level of the participant. The level may correspond to high school, university, etc.",
        "Only child": "Indicates whether the participant is an only child (1 if true, 0 if false).",
        "Village - town": "Indicates whether the participant lives in a village or a town (1 for village, 0 for town).",
        "House - block of flats": "Indicates whether the participant lives in a house or an apartment block."
    },
    "num_feature_intro": {
        "Music": "16. **Alternative music**: Don't enjoy at all 1-2-3-4-5 Enjoy very much (integer)",
        "Slow songs or fast songs": "Indicates preference for slow versus fast songs, rated from 1 to 5, where 1 means 'Strong preference for slow songs' and 5 means 'Strong preference for fast songs'.",
        "Dance": "3. **Dance, Disco, Funk**: Don't enjoy at all 1-2-3-4-5 Enjoy very much (integer)",
        "Folk": "4. **Folk music**: Don't enjoy at all 1-2-3-4-5 Enjoy very much (integer)",
        "Country": "5. **Country**: Don't enjoy at all 1-2-3-4-5 Enjoy very much (integer)",
        "Classical music": "Indicates preference for classical music, rated from 1 to 5, where 1 means 'Don't enjoy at all' and 5 means 'Enjoy very much'.",
        "Musical": "7. **Musicals**: Don't enjoy at all 1-2-3-4-5 Enjoy very much (integer)",
        "Pop": "8. **Pop**: Don't enjoy at all 1-2-3-4-5 Enjoy very much (integer)",
        "Rock": "15. **Rock n Roll**: Don't enjoy at all 1-2-3-4-5 Enjoy very much (integer)",
        "Metal or Hardrock": "Indicates preference for metal or hard rock music, rated from 1 to 5, where 1 means 'Don't enjoy at all' and 5 means 'Enjoy very much'.",
        "Punk": "11. **Punk**: Don't enjoy at all 1-2-3-4-5 Enjoy very much (integer)",
        "Hiphop, Rap": "Indicates preference for hip hop or rap music, rated from 1 to 5, where 1 means 'Don't enjoy at all' and 5 means 'Enjoy very much'.",
        "Reggae, Ska": "13. **Reggae, Ska**: Don't enjoy at all 1-2-3-4-5 Enjoy very much (integer)",
        "Swing, Jazz": "14. **Swing, Jazz**: Don't enjoy at all 1-2-3-4-5 Enjoy very much (integer)",
        "Rock n roll": "15. **Rock n Roll**: Don't enjoy at all 1-2-3-4-5 Enjoy very much (integer)",
        "Alternative": "16. **Alternative music**: Don't enjoy at all 1-2-3-4-5 Enjoy very much (integer)",
        "Latino": "Indicates preference for Latino music, rated from 1 to 5, where 1 means 'Don't enjoy at all' and 5 means 'Enjoy very much'.",
        "Techno, Trance": "18. **Techno, Trance**: Don't enjoy at all 1-2-3-4-5 Enjoy very much (integer)",
        "Opera": "19. **Opera**: Don't enjoy at all 1-2-3-4-5 Enjoy very much (integer)",
        "Movies": "26. **War movies**: Don't enjoy at all 1-2-3-4-5 Enjoy very much (integer)",
        "Horror": "21. **Horror movies**: Don't enjoy at all 1-2-3-4-5 Enjoy very much (integer)",
        "Thriller": "22. **Thriller movies**: Don't enjoy at all 1-2-3-4-5 Enjoy very much (integer)",
        "Comedy": "Indicates preference for comedy movies, rated from 1 to 5, where 1 means 'Don't enjoy at all' and 5 means 'Enjoy very much'.",
        "Romantic": "24. **Romantic movies**: Don't enjoy at all 1-2-3-4-5 Enjoy very much (integer)",
        "Sci-fi": "25. **Sci-fi movies**: Don't enjoy at all 1-2-3-4-5 Enjoy very much (integer)",
        "War": "26. **War movies**: Don't enjoy at all 1-2-3-4-5 Enjoy very much (integer)",
        "Fantasy/Fairy tales": "Indicates preference for fantasy or fairy tale movies, rated from 1 to 5, where 1 means 'Don't enjoy at all' and 5 means 'Enjoy very much'.",
        "Animated": "Indicates preference for animated movies, rated from 1 to 5, where 1 means 'Don't enjoy at all' and 5 means 'Enjoy very much'.",
        "Documentary": "Indicates preference for documentaries, rated from 1 to 5, where 1 means 'Don't enjoy at all' and 5 means 'Enjoy very much'.",
        "Western": "Indicates preference for western movies, rated from 1 to 5, where 1 means 'Don't enjoy at all' and 5 means 'Enjoy very much'.",
        "Action": "Indicates preference for action movies, rated from 1 to 5, where 1 means 'Don't enjoy at all' and 5 means 'Enjoy very much'.",
        "History": "Indicates preference for historical movies, rated from 1 to 5, where 1 means 'Don't enjoy at all' and 5 means 'Enjoy very much'.",
        "Psychology": "Indicates interest in psychology, rated from 1 to 5, where 1 means 'No interest' and 5 means 'Very interested'.",
        "Politics": "Indicates interest in politics, rated from 1 to 5, where 1 means 'No interest' and 5 means 'Very interested'.",
        "Mathematics": "Indicates interest in mathematics, rated from 1 to 5, where 1 means 'No interest' and 5 means 'Very interested'.",
        "Physics": "Indicates interest in physics, rated from 1 to 5, where 1 means 'No interest' and 5 means 'Very interested'.",
        "Internet": "Indicates interest in the internet, rated from 1 to 5, where 1 means 'No interest' and 5 means 'Very interested'.",
        "PC": "Indicates interest in personal computers, rated from 1 to 5, where 1 means 'No interest' and 5 means 'Very interested'.",
        "Economy Management": "Indicates interest in economy and management, rated from 1 to 5, where 1 means 'No interest' and 5 means 'Very interested'.",
        "Biology": "Indicates interest in biology, rated from 1 to 5, where 1 means 'No interest' and 5 means 'Very interested'.",
        "Chemistry": "Indicates interest in chemistry, rated from 1 to 5, where 1 means 'No interest' and 5 means 'Very interested'.",
        "Reading": "Indicates interest in reading, rated from 1 to 5, where 1 means 'No interest' and 5 means 'Very interested'.",
        "Geography": "Indicates interest in geography, rated from 1 to 5, where 1 means 'No interest' and 5 means 'Very interested'.",
        "Foreign languages": "Indicates interest in foreign languages, rated from 1 to 5, where 1 means 'No interest' and 5 means 'Very interested'.",
        "Medicine": "Indicates interest in medicine, rated from 1 to 5, where 1 means 'No interest' and 5 means 'Very interested'.",
        "Law": "Indicates interest in law, rated from 1 to 5, where 1 means 'No interest' and 5 means 'Very interested'.",
        "Cars": "Indicates interest in cars, rated from 1 to 5, where 1 means 'No interest' and 5 means 'Very interested'.",
        "Art exhibitions": "Indicates interest in art exhibitions, rated from 1 to 5, where 1 means 'No interest' and 5 means 'Very interested'.",
        "Religion": "Indicates interest in religion, rated from 1 to 5, where 1 means 'No interest' and 5 means 'Very interested'.",
        "Countryside, outdoors": "Indicates interest in countryside and outdoor activities, rated from 1 to 5, where 1 means 'No interest' and 5 means 'Very interested'.",
        "Dancing": "Indicates interest in dancing, rated from 1 to 5, where 1 means 'No interest' and 5 means 'Very interested'.",
        "Musical instruments": "Indicates interest in musical instruments, rated from 1 to 5, where 1 means 'No interest' and 5 means 'Very interested'.",
        "Writing": "Indicates interest in writing, rated from 1 to 5, where 1 means 'No interest' and 5 means 'Very interested'.",
        "Passive sport": "Indicates interest in passive sports, rated from 1 to 5, where 1 means 'No interest' and 5 means 'Very interested'.",
        "Active sport": "Indicates interest in active sports, rated from 1 to 5, where 1 means 'No interest' and 5 means 'Very interested'.",
        "Gardening": "Indicates interest in gardening, rated from 1 to 5, where 1 means 'No interest' and 5 means 'Very interested'.",
        "Celebrities": "Indicates interest in celebrities, rated from 1 to 5, where 1 means 'No interest' and 5 means 'Very interested'.",
        "Shopping": "Indicates interest in shopping, rated from 1 to 5, where 1 means 'No interest' and 5 means 'Very interested'.",
        "Science and technology": "Indicates interest in science and technology, rated from 1 to 5, where 1 means 'No interest' and 5 means 'Very interested'.",
        "Theatre": "Indicates interest in theatre, rated from 1 to 5, where 1 means 'No interest' and 5 means 'Very interested'.",
        "Fun with friends": "Indicates interest in fun with friends, rated from 1 to 5, where 1 means 'No interest' and 5 means 'Very interested'.",
        "Adrenaline sports": "Indicates interest in adrenaline sports, rated from 1 to 5, where 1 means 'No interest' and 5 means 'Very interested'.",
        "Pets": "Indicates interest in pets, rated from 1 to 5, where 1 means 'No interest' and 5 means 'Very interested'.",
        "Flying": "Indicates interest in flying, rated from 1 to 5, where 1 means 'No interest' and 5 means 'Very interested'.",
        "Storm": "Indicates interest in storms, rated from 1 to 5, where 1 means 'No interest' and 5 means 'Very interested'.",
        "Darkness": "Indicates interest in darkness, rated from 1 to 5, where 1 means 'No interest' and 5 means 'Very interested'.",
        "Heights": "Indicates interest in heights, rated from 1 to 5, where 1 means 'No interest' and 5 means 'Very interested'.",
        "Spiders": "Indicates interest in spiders, rated from 1 to 5, where 1 means 'No interest' and 5 means 'Very interested'.",
        "Snakes": "Indicates interest in snakes, rated from 1 to 5, where 1 means 'No interest' and 5 means 'Very interested'.",
        "Rats": "Indicates interest in rats, rated from 1 to 5, where 1 means 'No interest' and 5 means 'Very interested'.",
        "Ageing": "Indicates interest in ageing, rated from 1 to 5, where 1 means 'No interest' and 5 means 'Very interested'.",
        "Dangerous dogs": "Indicates interest in dangerous dogs, rated from 1 to 5, where 1 means 'No interest' and 5 means 'Very interested'.",
        "Fear of public speaking": "Indicates the fear of public speaking, rated from 1 to 5, where 1 means 'Not afraid' and 5 means 'Very afraid'.",
        "Healthy eating": "Indicates interest in healthy eating, rated from 1 to 5, where 1 means 'No interest' and 5 means 'Very interested'.",
        "Daily events": "Indicates interest in daily events, rated from 1 to 5, where 1 means 'No interest' and 5 means 'Very interested'.",
        "Prioritising workload": "Indicates the ability to prioritize workload, rated from 1 to 5, where 1 means 'Poor' and 5 means 'Excellent'.",
        "Writing notes": "Indicates the habit of writing notes, rated from 1 to 5, where 1 means 'Never' and 5 means 'Very often'.",
        "Workaholism": "Indicates the level of workaholism, rated from 1 to 5, where 1 means 'Not at all' and 5 means 'Very much'.",
        "Thinking ahead": "Indicates the tendency to think ahead, rated from 1 to 5, where 1 means 'Never' and 5 means 'Always'.",
        "Final judgement": "Indicates the tendency to make final judgments, rated from 1 to 5, where 1 means 'Never' and 5 means 'Always'.",
        "Reliability": "Indicates the reliability, rated from 1 to 5, where 1 means 'Not reliable' and 5 means 'Very reliable'.",
        "Keeping promises": "Indicates the ability to keep promises, rated from 1 to 5, where 1 means 'Never' and 5 means 'Always'.",
        "Loss of interest": "Indicates the tendency to lose interest, rated from 1 to 5, where 1 means 'Never' and 5 means 'Always'.",
        "Friends versus money": "Indicates preference between friends and money, rated from 1 to 5, where 1 means 'Friends' and 5 means 'Money'.",
        "Funniness": "Indicates the sense of humor, rated from 1 to 5, where 1 means 'Not funny at all' and 5 means 'Very funny'.",
        "Fake": "Indicates the tendency to act fake, rated from 1 to 5, where 1 means 'Never' and 5 means 'Always'.",
        "Criminal damage": "Indicates the tendency for criminal damage, rated from 1 to 5, where 1 means 'Never' and 5 means 'Always'.",
        "Decision making": "Indicates the ability to make decisions, rated from 1 to 5, where 1 means 'Poor' and 5 means 'Excellent'.",
        "Elections": "Indicates interest in elections, rated from 1 to 5, where 1 means 'No interest' and 5 means 'Very interested'.",
        "Self-criticism": "Indicates the level of self-criticism, rated from 1 to 5, where 1 means 'Not self-critical' and 5 means 'Very self-critical'.",
        "Judgment calls": "Indicates the ability to make judgment calls, rated from 1 to 5, where 1 means 'Poor' and 5 means 'Excellent'.",
        "Hypochondria": "Indicates the level of hypochondria, rated from 1 to 5, where 1 means 'Not at all' and 5 means 'Very much'.",
        "Empathy": "Indicates the level of empathy, rated from 1 to 5, where 1 means 'Not empathetic' and 5 means 'Very empathetic'.",
        "Eating to survive": "Indicates the relationship with food, rated from 1 to 5, where 1 means 'Not at all' and 5 means 'Very much'.",
        "Giving": "Indicates the tendency to give, rated from 1 to 5, where 1 means 'Not at all' and 5 means 'Very much'.",
        "Compassion to animals": "Indicates the level of compassion to animals, rated from 1 to 5, where 1 means 'Not at all' and 5 means 'Very much'.",
        "Borrowed stuff": "Indicates the tendency to borrow things, rated from 1 to 5, where 1 means 'Never' and 5 means 'Always'.",
        "Loneliness": "Indicates the level of loneliness, rated from 1 to 5, where 1 means 'Not lonely' and 5 means 'Very lonely'.",
        "Cheating in school": "Indicates the tendency to cheat in school, rated from 1 to 5, where 1 means 'Never' and 5 means 'Always'.",
        "Health": "Indicates the level of health, rated from 1 to 5, where 1 means 'Very poor' and 5 means 'Very good'.",
        "Changing the past": "Indicates the tendency to want to change the past, rated from 1 to 5, where 1 means 'Never' and 5 means 'Always'.",
        "God": "Indicates the belief in God, rated from 1 to 5, where 1 means 'Not at all' and 5 means 'Very much'.",
        "Dreams": "Indicates the level of interest in dreams, rated from 1 to 5, where 1 means 'No interest' and 5 means 'Very interested'.",
        "Charity": "Indicates the level of interest in charity, rated from 1 to 5, where 1 means 'No interest' and 5 means 'Very interested'.",
        "Number of friends": "Indicates the number of friends, rated from 1 to 5, where 1 means 'Very few' and 5 means 'Very many'.",
        "Waiting": "Indicates the ability to wait, rated from 1 to 5, where 1 means 'Never' and 5 means 'Always'.",
        "New environment": "Indicates the ability to adapt to a new environment, rated from 1 to 5, where 1 means 'Poor' and 5 means 'Excellent'.",
        "Mood swings": "Indicates the frequency of mood swings, rated from 1 to 5, where 1 means 'Never' and 5 means 'Always'.",
        "Appearence and gestures": "Indicates the importance of appearance and gestures, rated from 1 to 5, where 1 means 'Not important' and 5 means 'Very important'.",
        "Socializing": "Indicates the level of socializing, rated from 1 to 5, where 1 means 'Never' and 5 means 'Very often'.",
        "Achievements": "Indicates the level of achievements, rated from 1 to 5, where 1 means 'None' and 5 means 'Many'.",
        "Responding to a serious letter": "Indicates the ability to respond to a serious letter, rated from 1 to 5, where 1 means 'Poor' and 5 means 'Excellent'.",
        "Children": "Indicates the level of interest in children, rated from 1 to 5, where 1 means 'No interest' and 5 means 'Very interested'.",
        "Assertiveness": "Indicates the level of assertiveness, rated from 1 to 5, where 1 means 'Not assertive' and 5 means 'Very assertive'.",
        "Getting angry": "Indicates the tendency to get angry, rated from 1 to 5, where 1 means 'Never' and 5 means 'Very often'.",
        "Knowing the right people": "Indicates the importance of knowing the right people, rated from 1 to 5, where 1 means 'Not important' and 5 means 'Very important'.",
        "Public speaking": "Indicates the ability to speak in public, rated from 1 to 5, where 1 means 'Poor' and 5 means 'Excellent'.",
        "Unpopularity": "Indicates the level of unpopularity, rated from 1 to 5, where 1 means 'Not unpopular' and 5 means 'Very unpopular'.",
        "Life struggles": "Indicates the level of life struggles, rated from 1 to 5, where 1 means 'No struggles' and 5 means 'Many struggles'.",
        "Happiness in life": "Indicates the level of happiness in life, rated from 1 to 5, where 1 means 'Very unhappy' and 5 means 'Very happy'.",
        "Energy levels": "Indicates the level of energy, rated from 1 to 5, where 1 means 'Very low' and 5 means 'Very high'.",
        "Small - big dogs": "Indicates preference between small and big dogs, rated from 1 to 5, where 1 means 'Small dogs' and 5 means 'Big dogs'.",
        "Personality": "Indicates personality traits and views on life, rated from 1 to 5, where 1 means 'Not at all' and 5 means 'Very much'.",
        "Finding lost valuables": "Indicates the frequency of finding lost valuables, rated from 1 to 5, where 1 means 'Never' and 5 means 'Always'.",
        "Getting up": "Indicates the difficulty of getting up, rated from 1 to 5, where 1 means 'Very difficult' and 5 means 'Very easy'.",
        "Interests or hobbies": "Indicates interest in hobbies, rated from 1 to 5, where 1 means 'No interest' and 5 means 'Very interested'.",
        "Parents' advice": "Indicates the importance of parents' advice, rated from 1 to 5, where 1 means 'Not important' and 5 means 'Very important'.",
        "Questionnaires or polls": "Indicates the interest in questionnaires or polls, rated from 1 to 5, where 1 means 'No interest' and 5 means 'Very interested'.",
        "Finances": "Indicates the level of interest in finances, rated from 1 to 5, where 1 means 'No interest' and 5 means 'Very interested'.",
        "Shopping centres": "Indicates the interest in shopping centres, rated from 1 to 5, where 1 means 'No interest' and 5 means 'Very interested'.",
        "Branded clothing": "Indicates the interest in branded clothing, rated from 1 to 5, where 1 means 'No interest' and 5 means 'Very interested'.",
        "Entertainment spending": "Indicates the level of entertainment spending, rated from 1 to 5, where 1 means 'No interest' and 5 means 'Very interested'.",
        "Spending on looks": "Indicates the level of spending on looks, rated from 1 to 5, where 1 means 'No interest' and 5 means 'Very interested'.",
        "Spending on gadgets": "Indicates the level of spending on gadgets, rated from 1 to 5, where 1 means 'No interest' and 5 means 'Very interested'.",
        "Spending on healthy eating": "Indicates the level of spending on healthy eating, rated from 1 to 5, where 1 means 'No interest' and 5 means 'Very interested'.",
        "Age": "* (in slovak) Sleziak, P. - Sabo, M.: Gender differences in the prevalence of specific phobias. Forum Statisticum Slovacum. 2014, Vol. 10, No. 6. [Differences (gender + whether people lived in village/town) in the prevalence of phobias.]",
        "Height": "height",
        "Weight": "weight",
        "Number of siblings": "number of siblings"
    },
    "evaluation_metric": null,
    "task_type":"regression",
    "example":"https://www.kaggle.com/code/dillonmyrick/personality-the-predictor-of-you"

}