{
    "name": "US Accidents (2016 - 2023)",
    "source": "https://www.kaggle.com/datasets/sobhanmoosavi/us-accidents/data",
    "data_intro": "This is a countrywide car accident dataset that covers __49 states of the USA__. The accident data were collected from __February 2016 to March 2023__, using multiple APIs that provide streaming traffic incident (or event) data. These APIs broadcast traffic data captured by various entities, including the US and state departments of transportation, law enforcement agencies, traffic cameras, and traffic sensors within the road networks. The dataset currently contains approximately __7.7 million__ accident records. For more information about this dataset, please visit [here](https://smoosavi.org/datasets/us_accidents). This dataset was collected in real-time using multiple Traffic APIs. It contains accident data collected from February 2016 to March 2023 for the Contiguous United States.",
    "is_splited": false,
    "overall_size": 7728394,
    "train_size": 0,
    "test_size": 0,
    "c_classes": 20,
    "n_classes": 26,
    "cat_feature_intro": {
        "ID": "Unique identifier for each accident record.",
        "Source": "The source from which the accident data was collected, such as API providers.",
        "Start_Time": "The timestamp when the accident was first recorded.",
        "End_Time": "The timestamp when the accident was resolved or last recorded.",
        "Description": "Textual description of the accident event.",
        "Street": "The street where the accident occurred.",
        "City": "The city where the accident occurred.",
        "County": "The county where the accident occurred.",
        "State": "The state where the accident occurred.",
        "Zipcode": "The postal code corresponding to the accident location.",
        "Country": "The country where the accident occurred (should be 'US').",
        "Timezone": "The time zone of the accident location.",
        "Airport_Code": "The nearest airport to the accident location.",
        "Weather_Timestamp": "The timestamp of the weather data recorded at the time of the accident.",
        "Wind_Direction": "The direction from which the wind was blowing at the time of the accident.",
        "Weather_Condition": "The weather condition at the time of the accident (e.g., Rain, Clear, Fog).",
        "Sunrise_Sunset": "Indicates whether the accident occurred during daylight or night time.",
        "Civil_Twilight": "The civil twilight phase at the time of the accident.",
        "Nautical_Twilight": "The nautical twilight phase at the time of the accident.",
        "Astronomical_Twilight": "The astronomical twilight phase at the time of the accident."
    },
    "num_feature_intro": {
        "Severity": "The severity level of the accident, ranging from minor to major incidents.",
        "Start_Lat": "Latitude coordinate where the accident started.",
        "Start_Lng": "Longitude coordinate where the accident started.",
        "End_Lat": "Latitude coordinate where the accident ended (if available).",
        "End_Lng": "Longitude coordinate where the accident ended (if available).",
        "Distance(mi)": "The distance covered by the accident impact in miles.",
        "Temperature(F)": "The temperature in Fahrenheit at the time of the accident.",
        "Wind_Chill(F)": "The wind chill factor in Fahrenheit.",
        "Humidity(%)": "The humidity percentage at the accident location.",
        "Pressure(in)": "The atmospheric pressure in inches.",
        "Visibility(mi)": "The visibility in miles at the time of the accident.",
        "Wind_Speed(mph)": "The wind speed in miles per hour.",
        "Precipitation(in)": "The amount of precipitation in inches at the time of the accident.",
        "Amenity": "Boolean indicating whether the accident occurred near an amenity (e.g., park, store).",
        "Bump": "Boolean indicating whether there was a speed bump near the accident site.",
        "Crossing": "Boolean indicating whether the accident happened near a pedestrian crossing.",
        "Give_Way": "Boolean indicating whether the accident occurred at a give-way sign.",
        "Junction": "Boolean indicating whether the accident occurred at a junction.",
        "No_Exit": "Boolean indicating whether the accident occurred near a no-exit zone.",
        "Railway": "Boolean indicating whether the accident occurred near a railway crossing.",
        "Roundabout": "Boolean indicating whether the accident happened at a roundabout.",
        "Station": "Boolean indicating whether the accident occurred near a transportation station.",
        "Stop": "Boolean indicating whether the accident happened near a stop sign.",
        "Traffic_Calming": "Boolean indicating whether traffic calming measures were present.",
        "Traffic_Signal": "Boolean indicating whether a traffic signal was present at the accident site.",
        "Turning_Loop": "Boolean indicating whether the accident occurred at a turning loop."
    },
    "evaluation_metric": null,
    "task_type":"classification",
    "target":"Severity",
    "'example":"https://www.kaggle.com/code/whisgv/us-accidents-analysis"
}