{
    "name": "Used Cars Dataset",
    "source": "https://www.kaggle.com/datasets/austinreese/craigslist-carstrucks-data/data",
    "data_intro": "Craigslist is the world's largest collection of used vehicles for sale, yet it's very difficult to collect all of them in the same place. I built a scraper for a school project and expanded upon it later to create this dataset which includes every used vehicle entry within the United States on Craigslist. This data is scraped every few months, it contains most all relevant information that Craigslist provides on car sales including columns like price, condition, manufacturer, latitude/longitude, and 18 other categories. For ML projects, consider feature engineering on location columns such as long/lat. For previous listings, check older versions of the dataset.",
    "is_splited": false,
    "overall_size": 426880,
    "train_size": 0,
    "test_size": 0,
    "c_classes": 19,
    "n_classes": 7,
    "cat_feature_intro": {
        "url": "The URL of the Craigslist listing for the car.",
        "region": "The geographic region where the vehicle is listed for sale.",
        "region_url": "The URL for the region page on Craigslist where the car is listed.",
        "manufacturer": "The brand or manufacturer of the vehicle, such as Toyota, Ford, etc.",
        "model": "The specific model of the vehicle, e.g., Camry, F-150, etc.",
        "condition": "The condition of the car (e.g., new, like new, used, or parts).",
        "cylinders": "The number of cylinders in the vehicle's engine (e.g., 4, 6, 8 cylinders).",
        "fuel": "The type of fuel the vehicle uses, such as gas, diesel, or electric.",
        "title_status": "The status of the title of the vehicle (e.g., clean, salvage, rebuilt).",
        "transmission": "The type of transmission (e.g., automatic, manual).",
        "VIN": "The vehicle identification number, a unique code to identify the vehicle.",
        "drive": "The type of drive system in the vehicle, such as all-wheel drive (AWD), front-wheel drive (FWD), or rear-wheel drive (RWD).",
        "size": "The size of the vehicle, which could include categories like compact, midsize, or full-size.",
        "type": "The type of vehicle (e.g., sedan, truck, SUV, etc.).",
        "paint_color": "The color of the vehicle's exterior paint.",
        "image_url": "A link to an image of the vehicle listing.",
        "description": "A textual description of the vehicle, often written by the seller.",
        "state": "The state in which the vehicle is located (e.g., California, New York).",
        "posting_date": "The date the listing was posted on Craigslist."
    },
    "num_feature_intro": {
        "id": "A unique identifier for each listing in the dataset.",
        "price": "The asking price of the vehicle in US dollars.",
        "year": "The year the vehicle was manufactured.",
        "odometer": "The number of miles the vehicle has been driven, often used to assess the car's usage.",
        "county": "The county in which the vehicle is located, providing further geographic information.",
        "lat": "The latitude of the vehicle's location, useful for mapping and spatial analysis.",
        "long": "The longitude of the vehicle's location, useful for mapping and spatial analysis."
    },
    "evaluation_metric": null,
    "task_type": "classification",
    "target_feature": "type",
    "example":"https://www.kaggle.com/code/anasalshiekhbakri/used-cars-types-classification-simple-approach"
}